import 'package:dreams/const/locale_keys.dart';
import 'package:dreams/features/account/ui/about_us.dart';
import 'package:flutter/material.dart';

class PrivacyPolicyScreen extends StatelessWidget {
  const PrivacyPolicyScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return AboutUsScreen(
      title: LocaleKeys.privacyPolicy,
      aboutUs: '''أذونات'''
              '''\n'''
              '''لا يوجد إذن خطير في هذا التطبيق '''
              '''مشاكل البق و البرمجيات'''
              '''نحاول دائماً إصلاح المشكلات و تحسين البرامج ، و لكن نظراً لتشتت الأجهزة و إصدارات مختلفة من أندرويد ، قد يكون أداء البرنامج علي بعض الاجهزة أو الإصدارات مصحوباً بأخطاء و مشكلات ، و نعتذر عن ذلك. '''
              '''\n'''
              '''_ بموافقتك علي شروط الخصوصية فإنك توافق صراحة علي استخدام هذا الموقع علي مسؤوليتك و نتحمل جميع المخاطر المترتبة علي ذلك. و توافق علي أن موقعنا أو أي من أعضاء مجلس إدارتها او موظفيها أو وكلاتها أو الاشخاص الذين يوفرون المادة الموجودة في هذا الموقع أو الذين يرخصون لموقعنا باستعمالها أو أي منهم لا يقدم أي ضمانات علي أن الخدمة الموجودة في هذا الموقع ستكون دون انقطاع أو خالية من الاخطاء. أو أن أي عيوب قد توجد فيها سوف تصحح. أو أن الموقع الذي تقدم فيه أو وسيلة تقديمها خاليان من الفيروسات أو آفات البرامج.'''
              '''\n'''
              '''_ نحن نسعى بكل مجهوداتنا إلى توفير مادة صحيحة و من طرف أشخاص أكفاء والسهر علي حماية كل البيانات واحترام الأشخاص والمحافظة على الآداب العامة ونقوم بحجب أي مواد أو تعليقات مسيئة للأشخاص أو أي طرف كان وحجب القائم بها. لكن لا نتحمل مسؤولية سوء استخدام الموقع من طرف المستخدم.'''
              '''\n'''
              '''_ يحتفظ موقعنا ببيانات المشتركين في عضويته على أجهزة تشغيل وقواعد بيانات ونظم حماية ذات كفاءة عالية وإنك توافق على أن الموقع يحتفظ ببياناتك الشخصية واستخدامها من قبل أقسامه المعنية. و إنك توافق على عدم إعطاء هذه البيانات لأي مؤسسات أو شركات تجارية وغير تجارية إلا بعد موافقة صريحة منك. و إنك توافق علي أن الموقع لا يتحمل مسؤولية تسرب جزء أو كل بيانات العضو المشترك بسبب عمليات السطو والتخريب التي يقوم بها المهاجمون والمتسللون على شبكة الانترنت. و أن الموقع او أي من مسؤوليه لا يتحمل مسؤولية تلف أو ضياع هذه البيانات لأي سبب من الأسباب. و إنك توافق على إدخالها في الموقع دون أي'''
          .split('\n'),
    );
  }
}
